export const postsMainPage = [
  {
    id: 1,
    title: "Next.js",
    tag: ["frontend"],
    body: "Next.js - это фреймворк React для создания клиент-серверных (fullstack) веб-приложений. Мы используем компоненты React для разработки UI (user interface - пользовательский интерфейс) и Next.js для дополнительных возможностей и оптимизаций.",
    image: "/postImage/next.jpg",
  },
  {
    id: 2,
    title: "Versel",
    tag: ["frontend"],
    body: "Verse - это платформа для развертывания веб-приложений. Она предоставляет множество функций, таких как автоматическое развертывание, кэширование, а также интеграция с различными сервисами, такими как GitHub и GitLab.",
    image: "/postImage/versel.jpg",
  },
  {
    id: 3,
    title: "React",
    tag: ["frontend"],
    body: "React - это библиотека JavaScript для создания пользовательских интерфейсов. Она позволяет создавать динамические и интерактивные веб-приложения с использованием компонентов.",
    image: "/postImage/react.jpg",
  },
  {
    id: 4,
    title: "TypeScript",
    tag: ["frontend", "backend"],
    body: "TypeScript - это надмножество JavaScript, которое добавляет статическую типизацию. Он позволяет разработчикам писать более надежный и читаемый код, а также предоставляет дополнительные возможности, такие как интерфейсы и обобщения.",
    image: "/postImage/ts.png",
  },
  {
    id: 5,
    tag: ["backend"],
    title: "Express.js",
    body: "Express.js — фреймворк для создания веб-приложений на языке JavaScript, который строится на основе Node.js",
    image: "/postImage/express.jpg",
  },
  {
    id: 6,
    tag: ["backend"],
    title: "Docker",
    body: "Docker - это платформа для создания, развертывания и запуска приложений в контейнерах. Она позволяет разработчикам упаковывать приложения и их зависимости в контейнеры, которые могут быть запущены на любой системе, где установлен Docker.",
    image: "/postImage/docker.jpg",
  },
];
